app/views/users/show.html.erb

    <% (2..(Playlist.count+1)).each do |i| %>
    <% if Playlist.find(i).user_id == @user.id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]